_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_4 (Dense)              (None, 16)                816       
_________________________________________________________________
dense_5 (Dense)              (None, 16)                272       
_________________________________________________________________
dense_6 (Dense)              (None, 3)                 51        
=================================================================
Total params: 1,139
Trainable params: 1,139
Non-trainable params: 0
_________________________________________________________________
